dba/JMeter/TesteJMeter.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="TrabalhoFinalBD2_TesteDeEstresse">
      <stringProp name="TestPlan.comments">Arquivo criado para realizar testes de estresse no banco de dados populado pela API do SpaceX para análise dos resultados no trabalho final de Banco de Dados 2.</stringProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Grupo de usuários">
        <intProp name="ThreadGroup.num_threads">11</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">10</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="JDBC Connection Configuration">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">variavel_01</stringProp>
          <stringProp name="dbUrl">jdbc:postgresql://172.17.32.1:5432/spacex_bd2</stringProp>
          <stringProp name="driver">org.postgresql.Driver</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="password">spacex_app</stringProp>
          <stringProp name="poolMax">0</stringProp>
          <boolProp name="preinit">false</boolProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
          <stringProp name="username">spacex_app</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="JDBC Request">
          <stringProp name="dataSource">variavel_01</stringProp>
          <stringProp name="query">SELECT
    s.id AS satellite_id,
    s.version,
    s.velocity_kms,
    s.height_km,
    s.latitude,
    s.longitude,
    op.inclination,
    op.period,
    op.semimajor_axis,
    op.eccentricity,
    l.date_utc,
    r.name AS rocket_name,
    lp.region AS launch_region
FROM
    starlink_satellites s
JOIN orbital_parameters op ON op.starlink_id = s.id
JOIN launches l ON s.launch_id = l.id
JOIN rockets r ON l.rocket_id = r.id
JOIN launchpads lp ON l.launchpad_id = lp.id
WHERE
    s.decayed = FALSE
    AND s.velocity_kms BETWEEN 7.3 AND 7.9
    AND s.latitude BETWEEN -10 AND 10
    AND op.inclination BETWEEN 53.05 AND 53.06
    AND op.eccentricity BETWEEN 0.00017 AND 0.00018
    AND lp.region = &apos;Florida&apos;
ORDER BY
    op.period DESC,
    s.height_km DESC</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table">
          <boolProp name="ResultCollector.error_logging">true</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>